---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures
source: html/791a554f-8351-ef61-ca4a-e05e1bc76e72.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures

Failures about files saved by applications that were not developed or licensed by Autodesk.

## Syntax (C#)
```csharp
public static class ForeignFileFailures
```